export const ACADEMY_DATA = {
    images: {
      innerBanner: 'inner-header.png',
      arrowBread: 'arrow_bread.svg',
      print: 'print.svg',
      share: 'share.svg',
      email: 'email-icon.svg',
      firstSectionImage: 'inner_img_1.png',
      secondSectionImage: 'inner_img_2.png',
    },
    titles: {
      pageTitle: 'عن أكاديمية المركز الوطني لنظم الموارد الحكومية',
      firstSectionTitle: 'نبذة عن المركز',
      secondSectionTitle: 'نبذة عن المركز',
    },
    description: `المنصة التدريبية للمركز الوطني لنظم الموارد الحكومية هي أداة تعليمية متقدمة تهدف إلى تمكين الأفراد والجهات الحكومية من تطوير مهاراتهم ومعارفهم في مجالات نظم الموارد الحكومية. تقدم المنصة مجموعة متنوعة من البرامج التدريبية المصممة خصيصًا لتلبية احتياجات المتدربين، سواء عبر الدورات الذاتية أو الورش التدريبية الحضورية والافتراضية. كما تتيح المنصة مرونة في التعلم من خلال محتوى تعليمي شامل ومتاح عبر تطبيقات الأجهزة الذكية. نهدف من خلال هذه المنصة إلى تعزيز الكفاءة المهنية ودعم التحول الرقمي، بما .يتماشى مع أهداف رؤية المملكة 2030`,
    points: [
      'دعم التحول الرقمي: تمكين الجهات الحكومية من اعتماد الحلول التقنية الحديثة لتطوير خدماتها',
      '.تعزيز التكامل: تحقيق تكامل فعّال بين الجهات الحكومية من خلال أنظمة موحدة ومترابط',
      'دعم التحول الرقمي: تمكين الجهات الحكومية من اعتماد الحلول التقنية الحديثة لتطوير خدماتها',
      '.تعزيز التكامل: تحقيق تكامل فعّال بين الجهات الحكومية من خلال أنظمة موحدة ومترابط',
      'دعم التحول الرقمي: تمكين الجهات الحكومية من اعتماد الحلول التقنية الحديثة لتطوير خدماتها',
      '.تعزيز التكامل: تحقيق تكامل فعّال بين الجهات الحكومية من خلال أنظمة موحدة ومترابط'
    ]
  };
  