export const HomePageData = {
    bannerImages: [
      'img.png',
      'img.png',
      'img.png',
    ],
  
    aboutSection: {
      title: 'مرحبا بكم',
      subtitle1: 'في أكاديمية المركز الوطني لنظم الموارد الحكومية',
      subtitle2: 'بوابتكم لتجربة تعليمية مميزة',
      paragraphs: [
        'المنصة التدريبية للمركز الوطني لنظم الموارد الحكومية هي أداة تعليمية متقدمة تهدف إلى تمكين الأفراد والجهات الحكومية من تطوير مهاراتهم ومعارفهم في مجالات نظم الموارد الحكومية.',
        'تقدم المنصة مجموعة متنوعة من البرامج التدريبية المصممة خصيصًا لتلبية احتياجات المتدربين، سواء عبر الدورات الذاتية أو الورش التدريبية الحضورية والافتراضية. نهدف من خلال هذه المنصة إلى تعزيز الكفاءة المهنية ودعم التحول الرقمي، بما يتماشى مع أهداف رؤية المملكة 2030.'
      ],
      image: 'Photo_2.png'
    },
  
    newsSection: {
      title: 'أخبارنا',
      description: 'تابع آخر المستجدات وأهم الأخبار حول المبادرات والبرامج التدريبية، واطلع على مقالات ملهمة وفرص تسجيل مميزة',
      items: [
        {
          title: 'برامجنا التدريبية المميزة',
          description: 'اكتشف مجموعة متنوعة من البرامج التدريبية الحضورية المصممة لتطوير مهاراتك وبناء مستقبلك المهني. سجل الآن لتأمين مقعدك!',
          buttonText: 'عرض البرامج',
          image: 'Rectangle_1.png'
        },
        {
          title: 'مبادرتنا التدريبية',
          description: 'اكتشف مجموعة متنوعة من البرامج التدريبية الحضورية المصممة لتطوير مهاراتك وبناء مستقبلك المهني. سجل الآن لتأمين مقعدك!',
          buttonText: 'عرض المبادرات',
          image: 'Rectangle_2.png'
        }
      ]
    },
  
    accomplishments: [
      { image: 'sm_img_1.svg', count: '70+', label: 'برنامج تدريبي' },
      { image: 'sm_img_2.svg', count: '5530+', label: 'متدرب' },
      { image: 'sm_img_3.svg', count: '20+', label: 'برنامج دبلوم' },
      { image: 'sm_img_4.svg', count: '40+', label: 'ورشة تدريبية' },
      { image: 'sm_img_5.svg', count: '200+', label: 'شهادة معتمدة' },
      { image: 'sm_img_6.svg', count: '10+', label: 'شراكة تدريب' },
    ],
  
    interactiveEntities: [
      'slider_1.png',
      'slider_2.png',
      'slider_3.png',
      'slider_4.png',
      'slider_5.png',
      'slider_1.png',
      'slider_6.png',
      'slider_3.png',
      'slider_5.png',
      'slider_4.png'
    ]
  };
  