import { WorkshopSession } from "./components/workshop-requirement-item/workshop-requirement-item.component";

export const sessions: WorkshopSession[] = [
    {
        id: 1,
        title: 'مقدمة في التقارير الرقابية: المفهوم والأهداف والأنواع',
        type: 'session',
        date: '2025-02-10',
        isRequired: true
    },
    {
        id: 2,
        title: 'اختبر معلوماتك',
        type: 'online-quiz',
        currentQuestions: 3,
        currentScore: 9,
        totalScore: 10,
        "program": "تطوير مهارات إعداد التقارير الرقابية",
        "questions": [
            {
                "id": 1,
                "text": "ما الهدف الرئيسي من إعداد التقارير الرقابية؟",
                "options": [
                    "توثيق المعلومات فقط",
                    "تحسين الأداء واتخاذ القرارات المستندة إلى بيانات",
                    "الامتثال إلى الأنظمة دون تقييد بمتابعة التنفيذ",
                    "تقديم تقارير شكلية للإدارة"
                ],
                "correctAnswer": "تحسين الأداء واتخاذ القرارات المستندة إلى بيانات",
                "score": 4
            },
            {
                "id": 2,
                "text": "تُعتبر الموضوعية والحيادية من المبادئ الأساسية عند إعداد التقارير الرقابية",
                "options": [
                    "صواب",
                    "خطأ"
                ],
                "correctAnswer": "صواب",
                "score": 1
            }
        ]
    },
    {
        id: 3,
        title: 'اختبر معلوماتك 2',
        type: 'online-quiz',
        currentQuestions: 2,
        currentScore: 5,
        totalScore: 10,
        "program": "تطوير مهارات إعداد التقارير الرقابية 2",
        "questions": [
            {
                "id": 1,
                "text": "ما الهدف الرئيسي من إعداد التقارير الرقابية؟",
                "options": [
                    "توثيق المعلومات فقط",
                    "تحسين الأداء واتخاذ القرارات المستندة إلى بيانات",
                    "الامتثال إلى الأنظمة دون تقييد بمتابعة التنفيذ",
                    "تقديم تقارير شكلية للإدارة"
                ],
                "correctAnswer": "تحسين الأداء واتخاذ القرارات المستندة إلى بيانات",
                "score": 4
            },
            {
                "id": 2,
                "text": "ما الهدف الرئيسي من إعداد التقارير الرقابية؟",
                "options": [
                    "توثيق المعلومات فقط",
                    "تحسين الأداء واتخاذ القرارات المستندة إلى بيانات",
                    "الامتثال إلى الأنظمة دون تقييد بمتابعة التنفيذ",
                    "تقديم تقارير شكلية للإدارة"
                ],
                "correctAnswer": "تحسين الأداء واتخاذ القرارات المستندة إلى بيانات",
                "score": 4
            },
            {
                "id": 3,
                "text": "تُعتبر الموضوعية والحيادية من المبادئ الأساسية عند إعداد التقارير الرقابية",
                "options": [
                    "صواب",
                    "خطأ"
                ],
                "correctAnswer": "صواب",
                "score": 1
            }
        ]
    },
    {
        id: 3,
        title: 'الاختبار النهائي',
        type: 'offline-exam',
        date: '2025-02-20',
        time: '09:30 ص',
        duration: 120
    }
];